{
    "titulo_blog": "DEVELOPMENT TRICKS",
    "Buscar": "Search",
    "Email": "Email",
    "Comentarios": "Comments",
    "Enviar": "Send",
    "DEV":{
        "be":{
            "predisposicion":"PREDISPOSITION",
            "predisposicion1":"Before we tell the world that we are looking for a job, we must first know it inside. For obvious reasons, if you are looking for a job, it is presumably because you are totally convinced.",
            "predisposicion2":"Predisposition alone ends up being the major force that will connect everything.",
            "predisposicion3":"There is no point in starting a search without having it as an expendable goal in life.",
            "ejercicio_fisico":"PHYSICAL EXERCISE",
            "ejercicio1":"All that can be done in a healthy way.",
            "ejercicio2":"There are too many benefits associated with sport, especially what is sought after from this part is serotonin, the body's natural happy substance.",
            "ejercicio3":"That it accompanies every day as part of the routine of the search.",
            "curriculum":"CURRICULUM VITAE",
            "curriculum1":"Without a doubt, a resume with your personal, educational and professional information is required.",
            "curriculum2":"In this case I suggest these online resources where you can organize all your information:",
            "cv":{
                "cv1":"Resume formats, portfolios, legal letter formats, etc.",
                "cv2":"Create your resume in just 5 minutes",
                "cv3":"Your Curriculum Vitae fast, easy to use and professional",
                "cv4":"Create your resume like a professional",
                "cv5":"Create a job-ready resume in minutes",
                "cv6":"Free online resume builder",
                "cv7":"Your success story starts with a resume"
            },
            "carta":{
                "titulo":"COVER LETTER",
                "tx1":"It is a personal letter that will introduce you to the company or position you are applying for.",
                "tx2":"The words contained are usually very personal, the amazing thing about today is that if you ask artificial intelligence for help, it usually hits the nail on the head with inspiration.",
                "tx3":" \"Currently, I have been focused on frontend development in Angular, with more than 5 years of experience. I like to work in a team, seek continuous training, apply new knowledge in development, and put my creativity and heart in my daily work. I also consider life and the time we have an opportunity and a blessing to share the passion that makes us unique, and that the world expects and needs to thrive.\"..."
            },
            "marketplace":{
                "titulo":"TALENT MARKETPLACE",
                "tx1":"Employment agencies determine the labor focal point, this is where we are a product that must stand out to be seen and taken into account.",
                "tx2":"The outlook is favorable or not depending on the supply and demand of applicants, if there are few we will be very valuable and many things can be overlooked such as not fully mastering a technology or a senior position is required and ends up getting a semi, things like that.",
                "tx3":"In this case, let us consider that the outlook is not favorable and that it is up to us to find a way to stand out from the crowd.",
                "tx4":"If we have friends or relatives who can give us a direct recommendation in the company, let's use this possibility. A recruiter sees someone recommended better than a stranger initially.",
                "linkedin":{
                    "tx1":"The agencies' mom for employment with a much more complete sense focused on social networks.",
                    "tx2":"For this part it is required to make a personal marketing taking into account these points:",
                    "puntos":{
                        "tx1":"Expand my network with valuable contacts, according to my profile and what I am looking for.",
                        "tx2":"You need to be publishing valuable content.",
                        "tx3":"Comment, make strong propositive comments, for example: \"wow\" what a great article because...",
                        "tx4":"Write an attractive summary highlighting achievements and value propositions.",
                        "tx5":"Add custom message when sending connection requests, to explain why you want to connect.",
                        "tx6":"Follow companies that interest me and company recruiters.",
                        "tx7":"Join groups related to your industry or area of interest, participate in conversations, share knowledge and establish valuable connections."
                    },
                    "tx3":"You are required to fill in a series of fields that ask you very repetitively, personal data, study 1, study 2, company 1, company 2...",
                    "tx4":"Even if they are already included in the resume."
                }
            },
            "entrevista":{
                "titulo":"INTERVIEW",
                "tx1":"In some ways this is very similar to the date you get with the girl you like.",
                "tx2":"It is a big step and should be seen as a business in which both parties are looking for what there is to gain. For example, salary is an issue that both parties have an interest in and it is a point in which we must know how our profession is valued in the market.",
                "tx3":"Even if you feel very confident because you have done well in previous companies, or, if the opposite is the case and nerves did their damage, in both cases you should know the common questions and be clear that you must answer them without falsehoods. ",
                "tx4":"This is an excellent site with free interview preparation materials selected for busy people. ",
                "tx5":"These are some of the most common questions asked for each case:",
                "preguntas":{
                    "ctn1":{
                        "categoria":"PERSONNEL",
                        "bls":{
                            "bl1":{
                                "pregunta":"TELL ME ABOUT YOURSELF",
                                "sugerencia":"This is an open-ended question that gives you the opportunity to talk about your experience, interests, and personal and professional goals.",
                                "ejemplo":""
                            },
                            "bl2":{
                                "pregunta":"WHY ARE YOU INTERESTED IN WORKING IN OUR COMPANY?",
                                "sugerencia":" Interviewers want to know if you have researched the company and if you share their values and goals.",
                                "ejemplo":""
                            },
                            "bl3":{
                                "pregunta":"WHAT IS YOUR EXPERIENCE WORKING IN SOFTWARE DEVELOPMENT TEAMS?",
                                "sugerencia":"Here you may be asked about your communication skills, collaboration and adaptation to team dynamics.",
                                "ejemplo":""
                            },
                            "bl4":{
                                "pregunta":"CAN YOU DESCRIBE A CHALLENGING PROJECT YOU HAVE WORKED ON AND HOW YOU OVERCAME IT?",
                                "sugerencia":"This question assesses your problem-solving skills and your ability to meet challenges.",
                                "ejemplo":""
                            },
                            "bl5":{
                                "pregunta":"HOW DO YOU KEEP UP TO DATE WITH THE LATEST TRENDS AND TECHNOLOGIES IN SOFTWARE DEVELOPMENT?",
                                "sugerencia":" Interviewers want to know if you are a professional who keeps learning and stays current.",
                                "ejemplo":""
                            },
                            "bl6":{
                                "pregunta":"DO YOU HAVE ANY EXPERIENCE WORKING ON AGILE PROJECTS OR SPECIFIC DEVELOPMENT METHODOLOGIES?",
                                "sugerencia":"You may be asked about your adaptability and experience in specific development environments.",
                                "ejemplo":""
                            },
                            "bl7":{
                                "pregunta":"WHAT MOTIVATES YOU IN YOUR CAREER AS A SOFTWARE DEVELOPER?",
                                "sugerencia":"Here you can talk about your career goals and what excites you in software development.",
                                "ejemplo":""
                            },
                            "bl8":{
                                "pregunta":"HOW DO YOU HANDLE STRESS AND TIGHT DEADLINES?",
                                "sugerencia":"This question assesses your ability to deal with high-pressure situations.",
                                "ejemplo":""
                            },
                            "bl9":{
                                "pregunta":"DO YOU HAVE EXPERIENCE IN LEADERSHIP OR MANAGEMENT OF DEVELOPMENT TEAMS?",
                                "sugerencia":"This could explore your potential to take on leadership roles in the future.",
                                "ejemplo":""
                            },
                            "bl10":{
                                "pregunta":"WHAT IS YOUR APPROACH TO CODE QUALITY AND SUSTAINABLE DEVELOPMENT PRACTICES?",
                                "sugerencia":"Interviewers may be interested in your commitment to quality and continuous improvement.",
                                "ejemplo":""
                            }
                            
                        }
                    },
                    "ctn2":{
                        "categoria":"LABOR",
                        "bls":{
                            "bl1":{
                                "pregunta":"WHAT WAS THE LAST COMPANY WHERE YOU WORKED?",
                                "sugerencia":"",
                                "ejemplo":""
                            },
                            "bl2":{
                                "pregunta":"TELL US ABOUT YOUR EXPERIENCE IN THE LAST COMPANY?",
                                "sugerencia":"",
                                "ejemplo":""
                            },
                            "bl3":{
                                "pregunta":"WHAT WAS YOUR BIGGEST CHALLENGE IN THIS COMPANY AND WHY?",
                                "sugerencia":"",
                                "ejemplo":""
                            }
                        }
                    },
                    "ctn3":{
                        "categoria":"STUDIES",
                        "bls":{
                            "bl1":{
                                "pregunta":"UP TO WHAT LEVEL DID YOU STUDY?",
                                "sugerencia":"",
                                "ejemplo":""
                            },
                            "bl2":{
                                "pregunta":"DO YOU HAVE A MASTER'S DEGREE OR DIPLOMA?",
                                "sugerencia":"",
                                "ejemplo":""
                            } 
                        }
                    },
                    "ctn4":{
                        "categoria":"FRONTEND DEVELOPMENT",
                        "bls":{
                            "bl1":{
                                "pregunta":"DO YOU HAVE EXPERIENCE IN TYPESCRIPT AND JAVASCRIPT DESIGN PATTERNS?",
                                "sugerencia":"",
                                "ejemplo":""
                            },
                            "bl2":{
                                "pregunta":"DO YOU HAVE EXPERIENCE IN ATOMIC DESIGN ARCHITECTURE?",
                                "sugerencia":"",
                                "ejemplo":""
                            }
                        }
                    },
                    "ctn5":{
                        "categoria":"HTML, CSS AND JAVASCRIPT",
                        "bls":{
                            "bl1":{
                                "pregunta":"WHICH HTML ATTRIBUTE IS USED TO DEFINE INLINE STYLES?",
                                "sugerencia":"",
                                "ejemplo":"This is the style attribute."
                            },
                            "bl2":{
                                "pregunta":"WHICH HTML TAG IS USED TO DEFINE AN EXTERNAL STYLE SHEET?",
                                "sugerencia":"",
                                "ejemplo":"It is the link tag and the path is added in the src attribute."
                            },
                            "bl3":{
                                "pregunta":"WHICH PSEUDO CLASS IS USED TO DEFINE A PROPERTY WHEN THE MOUSE CURSOR IS PLACED OVER AN ELEMENT?",
                                "sugerencia":"",
                                "ejemplo":"The pseudo hover class preceded by a colon."
                            },
                            "bl4":{
                                "pregunta":"IN CSS WHAT IS THE DIFFERENCE BETWEEN MARGIN AND PADDING PROPERTIES?",
                                "sugerencia":"",
                                "ejemplo":"Margin is the space outside the DOM element and padding is applied inside the body of the DOM element to which the class is being applied."
                            },
                            "bl5":{
                                "pregunta":"WHAT DOES THE ACRONYM CSS STAND FOR?",
                                "sugerencia":"",
                                "ejemplo":"Cascade Style Sheet"
                            },
                            "bl6":{
                                "pregunta":"IN CSS3 WHAT DO THE \"A\" IN RGBA?",
                                "sugerencia":"",
                                "ejemplo":"The 4 stand for R:red, G:green, B:blue, A:alpha (transparency)."
                            },
                            "bl7":{
                                "pregunta":"HOW DO YOU ASSIGN STYLES FOR DIFFERENT DEVICES AND RESOLUTIONS?",
                                "sugerencia":"",
                                "ejemplo":"Through the @media property within the cascading styles."
                            },
                            "bl8":{
                                "pregunta":"WHAT WOULD YOU BE DEFINING WHEN USING FLEX-DIRECTION: COLUMN; IN AN ELEMENT WITH DISPLAY: FLEX;?",
                                "sugerencia":"",
                                "ejemplo":"that the elements inside the display: flex are formed as a column."
                            },
                            "bl9":{
                                "pregunta":"EXPLAINS THE FUNCTION OF @IMPORT IN SASS",
                                "sugerencia":"",
                                "ejemplo":"The purpose of the @import directive is to connect several SASS or SCSS files to a file of type SASS or SCSS, in order to sort the code separately."
                            },
                            "bl10":{
                                "pregunta":"EXPLAINS THE FUNCTION OF @EXTEND IN SASS",
                                "sugerencia":"",
                                "ejemplo":"This directive has a special quality in that it allows inheriting characteristics from one class or selector to another selector, avoiding the repetition of styles."
                            },
                            "bl11":{
                                "pregunta":"EXPLAINS WHEN YOU CAN USE THE % PLACEHOLDER IN SASS",
                                "sugerencia":"",
                                "ejemplo":"It is used when creating a group of styles %name {css features}, after being created it works inside a class when referring to the inheritance of %name and therefore inherits the styles, like this: .class { @extend %name;}"
                            },
                            "bl12":{
                                "pregunta":"EXPLAIN IN YOUR OWN WORDS HOW MIXINS (@MIXIN) IN SASS CAN BE USEFUL",
                                "sugerencia":"",
                                "ejemplo":"It allows you to reuse CSS styles and properties in your stylesheets in a modular and efficient way. A great utility is to be able to pass parameters to a previously created @mixin and use all the features of that @mixin with the parameter that is sent."
                            },
                            "bl13":{
                                "pregunta":"EN HTML, EL ATRIBUTO TITLE SE EMPLEA PARA:",
                                "sugerencia":"",
                                "ejemplo":"Es para proporcionar información adicional sobre un elemento cuando el usuario pasa el cursor sobre él."
                            },
                            "bl14":{
                                "pregunta":"EN HTML, PARA INCLUIR CÓDIGO DE SCRIPT QUE SE ENCUENTRA EN OTRO ARCHIVO (EXTERNO) SE EMPLEA EL TAG:",
                                "sugerencia":"",
                                "ejemplo":"<script> con el src=\"\" y la ruta del archivo."
                            },
                            "bl15":{
                                "pregunta":"EN HTML PARA DEFINIR UNA LINEA HORIZONTAL DE SEPARACIÓN SE EMPLEA:",
                                "sugerencia":"",
                                "ejemplo":"Se usa la etiqueta <hr>."
                            },
                            "bl16":{
                                "pregunta":"EN HTML PARA DEFINIR QUE EL IDIOMA PRINCIPAL DE UNA PÁGINA ES EL ESPAÑOL SE EMPLEA",
                                "sugerencia":"",
                                "ejemplo":"Dentro de la etiqueta HTML se emplea un atributo llamado lang=\"es\", adicional es recomendable usar también la misma propiedad en etiquetas como \"header\", \"main\", \"section\", \"footer\", para ayudar a las herramientas de traducción."
                            },
                            "bl17":{
                                "pregunta":"EN HTML, ROWSPAN Y COLSPAN SON ATRIBUTOS DE LA ETIQUETA",
                                "sugerencia":"",
                                "ejemplo":"Etiqueta <td>, son para controlar la fusión de celdas, lo que permite que una celda ocupe múltiples filas \"rowspan\" o múltiples columnas \"colspan\"."
                            },
                            "bl18":{
                                "pregunta":"¿QUÉ ETIQUETA DE HTML SE EMPLEA PARA DEFINIR UNA HOJA DE ESTILO INTERNA?",
                                "sugerencia":"",
                                "ejemplo":"<style>"
                            },
                            "bl19":{
                                "pregunta":"EN HTML, EL ATRIBUTO ALT SE EMPLEA PARA:",
                                "sugerencia":"",
                                "ejemplo":"3 principales beneficios como: -Descripción de accesiblidad en imágenes para personas con poca visiblidad, - Cuando las imágenes no se cargan correctamente proporcionan información del contenido, - En el SEO de búsqueda permiten una mejor indexación en los resultados. En las etiquetas <img>, <audio> y <video>."
                            },
                            "bl20":{
                                "pregunta":"EN HTML LA FORMA CORRECTA DE CREAR UN COMENTARIO ES:",
                                "sugerencia":"",
                                "ejemplo":"<---- comentario ---->"
                            },
                            "bl21":{
                                "pregunta":"¿QUÉ ESTRUCTURA SIGUE EL DOM?",
                                "sugerencia":"El DOM, o Document Object Model (Modelo de Objetos del Documento, en español), sigue una jerarquía, donde un nodo principal llamado \"nodo raíz\" representa todo el documento. A partir de este nodo raíz, se ramifican nodos que representan los elementos del documento, como etiquetas HTML, atributos y contenido de texto. Estos nodos están conectados entre sí de manera jerárquica, reflejando la estructura anidada del documento original.",
                                "ejemplo":""
                            },
                            "bl22":{
                                "pregunta":"NOMBRA TODOS LOS ELEMENTOS QUE CONOZCAS QUE FUERON INTRODUCIDOS EN HTML 5",
                                "sugerencia":"",
                                "ejemplo":""
                            },
                            "bl23":{
                                "pregunta":"¿CUÁL ES LA DIFERENCIA ENTRE VAR, LET Y CONST?",
                                "sugerencia":"",
                                "ejemplo":""
                            },
                            "bl24":{
                                "pregunta":"¿QUÉ ES ECMA Y/O QUE DEFINE?",
                                "sugerencia":"",
                                "ejemplo":""
                            },
                            "bl25":{
                                "pregunta":"MENCIONA AL MENOS DOS FRAMEWORKS DE TEST UNITARIOS PARA JAVASCRIPT",
                                "sugerencia":"",
                                "ejemplo":""
                            },
                            "bl26":{
                                "pregunta":"¿CUÁL ES LA DIFERENCIA ENTRE UNA CLASE Y UN OBJETO EN PROGRAMACIÓN?",
                                "sugerencia":"",
                                "ejemplo":""
                            },
                            "bl27":{
                                "pregunta":"¿QUÉ FORMAS HAY PARA OBTENER LAS VARIABLES DEL SIGUIENTE OBJETO USANDO ES5 Y ES6 CONST USER = {NAME: USERNAME, AGE: 99}",
                                "sugerencia":"",
                                "ejemplo":""
                            },
                            "bl28":{
                                "pregunta":"EXPLICA QUÉ HACE LA SIGUIENTE LÍNEA CONSIDERANDO QUE MONTHS ES UN ARRAY DE MESES: MONTHS.SPLICE(1, 0, \"FEB\");",
                                "sugerencia":"",
                                "ejemplo":""
                            },
                            "bl29":{
                                "pregunta":"DESCRIBE EN DETALLE TODO LO QUE PUEDAS OBSERVAR DE LA SIGUIENTE FUNCIÓN: \"(() ⇒ {CONSOLE.LOG(\"HOLA MUNDO\");})()\"",
                                "sugerencia":"",
                                "ejemplo":""
                            },
                            "bl30":{
                                "pregunta":"CREA UNA PETICIÓN HTTP BÁSICA DE TIPO GET UTILIZANDO JAVASCRIPT A UN DOMINIO DE TU ELECCIÓN",
                                "sugerencia":"",
                                "ejemplo":""
                            },
                            "bl31":{
                                "pregunta":"¿CUÁL ES LA DIFERENCIA ENTRE UN TEST UNITARIO, TEST DE INTEGRACIÓN Y UN TEST DE ACEPTACIÓN?",
                                "sugerencia":"",
                                "ejemplo":""
                            },
                            "bl32":{
                                "pregunta":"¿QUÉ CARACTERÍSTICAS DEBE TENER UN BUEN TEST UNITARIO?",
                                "sugerencia":"",
                                "ejemplo":""
                            },
                            "bl33":{
                                "pregunta":"EN EL CICLO DE VIDA DE VUE, CUAL SERÍA LA DIFERENCIA ENTRE \"CREATED\" Y \"MOUNTED\"",
                                "sugerencia":"",
                                "ejemplo":""
                            }
                        }
                    }
                },
                "Sugerencia":"Sugerencia",
                "Respuesta ejemplo":"Respuesta ejemplo"
            },
            "prueba":{
                "titulo":"PRUEBA TÉCNICA",
                "tx1":"Lograr pasar efectivamente la prueba técnica, puede llegar a considerarse el primer pie dentro de la empresa.",
                "tx2":"En un perfil con experiencia debería ser tomado como un requerimiento normal de trabajo.",
                "tx3":"Con o sin experiencia hay que entrenar antes, estas son algunas herramientas para lograrlo:",
                "tx4":"Las habilidades hablan más que las palabras.",
                "tx5":"Ayudamos a las empresas a desarrollar los equipos tecnológicos más fuertes.",
                "tx6":"Ayudamos a los candidatos a perfeccionar sus habilidades tecnológicas y a buscar oportunidades de empleo."
            }
        }
    }
}